wolfssl-jp/TOPPERS-ASP/asp/arch/rx_gcc/rx72n/rx72n.h
/*
 *  各モジュールのレジスタ及び設定ビット情報
 */

/*
 *  Register write protection
 */
#define SYSTEM_PRCR_ADDR ( 0x000803FE )
#define SYSTEM_PRKEY  0xA500
#define SYSTEM_PRC0	( 1UL << 0U )
#define SYSTEM_PRC1	( 1UL << 1U )
#define SYSTEM_PRC3	( 1UL << 3U )

/*
 * Clock generater
 */
//SCKCR define
#define CKG_SCKCR_ADDR ( ( volatile uint32_t *)0x00080020 )
#define CKG_SCKCR_RESERVE 0x11
#define CKG_SCKCR_PB_DIV01 ( 0UL << 8 )
#define CKG_SCKCR_PB_DIV02 ( 1UL << 8 )
#define CKG_SCKCR_PB_DIV04 ( 2UL << 8 )
#define CKG_SCKCR_PB_DIV08 ( 3UL << 8 )
#define CKG_SCKCR_PB_DIV16 ( 4UL << 8 )
#define CKG_SCKCR_PB_DIV32 ( 5UL << 8 )
#define CKG_SCKCR_PB_DIV64 ( 6UL << 8 )
#define CKG_SCKCR_PA_DIV01 ( 0UL << 12 )
#define CKG_SCKCR_PA_DIV02 ( 1UL << 12 )
#define CKG_SCKCR_PA_DIV04 ( 2UL << 12 )
#define CKG_SCKCR_PA_DIV08 ( 3UL << 12 )
#define CKG_SCKCR_PA_DIV16 ( 4UL << 12 )
#define CKG_SCKCR_PA_DIV32 ( 5UL << 12 )
#define CKG_SCKCR_PA_DIV64 ( 6UL << 12 )
#define CKG_SCKCR_BCK_DIV01 ( 0UL << 16 )
#define CKG_SCKCR_BCK_DIV02 ( 1UL << 16 )
#define CKG_SCKCR_BCK_DIV04 ( 2UL << 16 )
#define CKG_SCKCR_BCK_DIV08 ( 3UL << 16 )
#define CKG_SCKCR_BCK_DIV16 ( 4UL << 16 )
#define CKG_SCKCR_BCK_DIV32 ( 5UL << 16 )
#define CKG_SCKCR_BCK_DIV64 ( 6UL << 16 )
#define CKG_SCKCR_PSTOP0 ( 1UL << 22 )
#define CKG_SCKCR_PSTOP1 ( 1UL << 23 )
#define CKG_SCKCR_ICK_DIV01  ( 0UL << 24 )
#define CKG_SCKCR_ICK_DIV02  ( 1UL << 24 )
#define CKG_SCKCR_ICK_DIV04  ( 2UL << 24 )
#define CKG_SCKCR_ICK_DIV08  ( 3UL << 24 )
#define CKG_SCKCR_ICK_DIV16  ( 4UL << 24 )
#define CKG_SCKCR_ICK_DIV32  ( 5UL << 24 )
#define CKG_SCKCR_ICK_DIV64  ( 6UL << 24 )
#define CKG_SCKCR_FCK_DIV01  ( 0UL << 28 )
#define CKG_SCKCR_FCK_DIV02  ( 1UL << 28 )
#define CKG_SCKCR_FCK_DIV04  ( 2UL << 28 )
#define CKG_SCKCR_FCK_DIV08  ( 3UL << 28 )
#define CKG_SCKCR_FCK_DIV16  ( 4UL << 28 )
#define CKG_SCKCR_FCK_DIV32  ( 5UL << 28 )
#define CKG_SCKCR_FCK_DIV64  ( 6UL << 28 )

#define CKG_SCKCR2_ADDR ( ( volatile uint16_t *)0x00080024 )
#define CKG_SCKCR2_IEBCK_DIV2   1UL
#define CKG_SCKCR2_IEBCK_DIV4   2UL
#define CKG_SCKCR2_IEBCK_DIV8   3UL
#define CKG_SCKCR2_IEBCK_DIV16  4UL
#define CKG_SCKCR2_IEBCK_DIV32  5UL
#define CKG_SCKCR2_IEBCK_DIV64  6UL
#define CKG_SCKCR2_IEBCK_DIV6   12UL
#define CKG_SCKCR2_UCK_NOT_USE (1UL << 4)
#define CKG_SCKCR2_UCK_DIV3 (2UL << 4)
#define CKG_SCKCR2_UCK_DIV4 (3UL << 4)


//CLock Select register
#define CKG_SCKCR3_ADDR ( ( volatile uint16_t *)0x00080026 )
#define CKG_SCKCR3_LOCO ( 0UL << 8 )
#define CKG_SCKCR3_HOCO ( 1UL << 8 )
#define CKG_SCKCR3_MAIN ( 2UL << 8 )
#define CKG_SCKCR3_SUB ( 3UL << 8 )
#define CKG_SCKCR3_PLL ( 4UL << 8 )
//PLL freq setting
#define CKG_PLLCR_ADDR ( ( volatile uint16_t *)0x00080028 )
#define CKG_PLLCR_PLIDIV1 ( 0UL << 0U )
#define CKG_PLLCR_PLIDIV2 ( 1UL << 0U )
#define CKG_PLLCR_PLIDIV4 ( 2UL << 0U )
#define CKG_PLLCR_STC8  ( 0x07UL << 8U )
#define CKG_PLLCR_STC10 ( 0x09UL << 8U )
#define CKG_PLLCR_STC12 ( 0x0BUL << 8U )
#define CKG_PLLCR_STC16 ( 0x0FUL << 8U )
#define CKG_PLLCR_STC20 ( 0x13UL << 8U )
#define CKG_PLLCR_STC24 ( 0x17UL << 8U )
#define CKG_PLLCR_STC25 ( 0x18UL << 8U )
#define CKG_PLLCR_STC50 ( 0x19UL << 8U )
//Clock enable setting
#define CKG_PLLCR2_ADDR ( ( volatile uint16_t *)0x0008002A )
#define CKG_MOSCCR_ADDR ( ( volatile uint8_t *)0x00080032 )
#define CKG_SOSCCR_ADDR ( ( volatile uint8_t *)0x00080033 )
#define CKG_LOSCCR_ADDR ( ( volatile uint8_t *)0x00080034 )
#define CKG_ILOCOCR_ADDR ( ( volatile uint8_t *)0x00080035 )
#define CKG_HOCOCR_ADDR ( ( volatile uint8_t *)0x00080036 )

#define CKG_CLOCK_ENABLE  0UL
#define CKG_COCCK_DISABLE 1UL




/*
 * モジュールストップコントロールレジスタA（MSTPCRA）
 */

#define SYSTEM_MSTPCRA_ADDR			( ( volatile uint32_t  * )0x00080010 )
#define SYSTEM_MSTPCRA_MSTPA4_TMR3_2	( 1UL << 4U )
#define SYSTEM_MSTPCRA_MSTPA5_TMR1_0	( 1UL << 5U )
#define SYSTEM_MSTPCRA_MSTPA9_MTU	( 1UL << 9U )
#define SYSTEM_MSTPCRA_MSTPA10_PPG1	( 1UL << 10U )
#define SYSTEM_MSTPCRA_MSTPA11_PPG0	( 1UL << 11U )
#define SYSTEM_MSTPCRA_MSTPA12_TPU_U1	( 1UL << 12U )
#define SYSTEM_MSTPCRA_MSTPA13_TPU_U0	( 1UL << 13U )
#define SYSTEM_MSTPCRA_MSTPA14_CMT_U1	( 1UL << 14U )
#define SYSTEM_MSTPCRA_MSTPA15_CMT_U0	( 1UL << 15U )
#define SYSTEM_MSTPCRA_MSTPA17_S12AD	( 1UL << 17U )
#define SYSTEM_MSTPCRA_MSTPA19_DA	( 1UL << 19U )
#define SYSTEM_MSTPCRA_MSTPA23_AD	( 1UL << 23U )
#define SYSTEM_MSTPCRA_MSTPA24_BIT	( 1UL << 24U )
#define SYSTEM_MSTPCRA_MSTPA27_BIT	( 1UL << 27U )
#define SYSTEM_MSTPCRA_MSTPA28_DMAC_DTC	( 1UL << 28U )
#define SYSTEM_MSTPCRA_MSTPA29_EXDMAC	( 1UL << 29U )
#define SYSTEM_MSTPCRA_ACSE		( 1UL << 31U)


/*
 * モジュールストップコントロールレジスタB（MSTPCRB）
 */


#define SYSTEM_MSTPCRB_ADDR			( ( volatile uint32_t  * )0x00080014 )
#define SYSTEM_MSTPCRB_MSTPB0_CAN0	( 1UL << 0U )
#define SYSTEM_MSTPCRB_MSTPB1_CAN1	( 1UL << 1U )
#define SYSTEM_MSTPCRB_MSTPB2_CAN2	( 1UL << 2U )
#define SYSTEM_MSTPCRB_MSTPB4_SCId	( 1UL << 4U )
#define SYSTEM_MSTPCRB_MSTPB8_THERMO	( 1UL << 8U )
#define SYSTEM_MSTPCRB_MSTPB15_EDMAC	( 1UL << 15U )
#define SYSTEM_MSTPCRB_MSTPB16_RSPI1	( 1UL << 16U )
#define SYSTEM_MSTPCRB_MSTPB17_RSPI0	( 1UL << 17U )
#define SYSTEM_MSTPCRB_MSTPB18_USB1	( 1UL << 18U )
#define SYSTEM_MSTPCRB_MSTPB19_USB0	( 1UL << 19U )
#define SYSTEM_MSTPCRB_MSTPB20_RIIC1	( 1UL << 20U )
#define SYSTEM_MSTPCRB_MSTPB21_RIIC0	( 1UL << 21U )
#define SYSTEM_MSTPCRB_MSTPB22_PDC	( 1UL << 22U )
#define SYSTEM_MSTPCRB_MSTPB23_CRC	( 1UL << 23U )
#define SYSTEM_MSTPCRB_MSTPB24_SCI7	( 1UL << 24U )
#define SYSTEM_MSTPCRB_MSTPB25_SCI6	( 1UL << 25U )
#define SYSTEM_MSTPCRB_MSTPB26_SCI5	( 1UL << 26U )
#define SYSTEM_MSTPCRB_MSTPB27_SCI4	( 1UL << 27U )
#define SYSTEM_MSTPCRB_MSTPB28_SCI3	( 1UL << 28U )
#define SYSTEM_MSTPCRB_MSTPB29_SCI2	( 1UL << 29U )
#define SYSTEM_MSTPCRB_MSTPB30_SCI1 ( 1UL << 30U )
#define SYSTEM_MSTPCRB_MSTPB31_SCI0 ( 1UL << 31U )

/*
 * モジュールストップコントロールレジスタC（MSTPCRC）
 */

#define SYSTEM_MSTPCRC_ADDR			( ( volatile uint32_t  * )0x00080018 )
#define SYSTEM_MSTPCRC_MSTPC0_RAM0 ( 1UL << 0U )
#define SYSTEM_MSTPCRC_MSTPC1_RAM1 ( 1UL << 1U )
#define SYSTEM_MSTPCRC_MSTPC16_RIIC3 ( 1UL << 16U )
#define SYSTEM_MSTPCRC_MSTPC17_RIIC2 ( 1UL << 17U )
#define SYSTEM_MSTPCRC_MSTPC18_IEBUS ( 1UL << 18U )
#define SYSTEM_MSTPCRC_MSTPC19_MCK ( 1UL << 19U )
#define SYSTEM_MSTPCRC_MSTPC22_RSPI2 ( 1UL << 22U )
#define SYSTEM_MSTPCRC_MSTPC24_SCI11 ( 1UL << 24U )
#define SYSTEM_MSTPCRC_MSTPC25_SCI10	( 1UL << 25U )
#define SYSTEM_MSTPCRC_MSTPC26_SCI9	( 1UL << 26U )
#define SYSTEM_MSTPCRC_MSTPC27_SCI8	( 1UL << 27U )


