wolfssl-jp/TOPPERS-ASP/asp/arch/rx_gcc/rx72n/rx72n.h
/*
 * BUS Register
 */
//CSn control register
#define BUS_CS0CR_ADDR ((volatile uint16_t*)0x00083802)
#define BUS_CS1CR_ADDR ((volatile uint16_t*)0x00083812)
#define BUS_CS2CR_ADDR ((volatile uint16_t*)0x00083822)
#define BUS_CS3CR_ADDR ((volatile uint16_t*)0x00083832)
#define BUS_CS4CR_ADDR ((volatile uint16_t*)0x00083842)
#define BUS_CS5CR_ADDR ((volatile uint16_t*)0x00083852)
#define BUS_CS6CR_ADDR ((volatile uint16_t*)0x00083862)
#define BUS_CS7CR_ADDR ((volatile uint16_t*)0x00083872)
#define BUS_CSNCR_EXENB_EN 0x1
#define BUS_CSNCR_EXENB_DIS 0x0
#define BUS_CSNCR_BSIZE_16 0x00
#define BUS_CSNCR_BSIZE_32 0x10
#define BUS_CSNCR_BSIZE_8 0x30
#define BUS_CSNCR_EMODE_DIF 0x100
#define BUS_CSNCR_EMODE_SAME 0x000
#define BUS_CSNCR_MPXEN_ENABLE 0x0x1000
#define BUS_CSNCR_MPXEN_DISABLE 0x0x0000
//CSn recovery cycle control register
#define BUS_CS0REC_ADDR ((volatile uint16_t*)0x0008380A)
#define BUS_CS1REC_ADDR ((volatile uint16_t*)0x0008381A)
#define BUS_CS2REC_ADDR ((volatile uint16_t*)0x0008382A)
#define BUS_CS3REC_ADDR ((volatile uint16_t*)0x0008383A)
#define BUS_CS4REC_ADDR ((volatile uint16_t*)0x0008384A)
#define BUS_CS5REC_ADDR ((volatile uint16_t*)0x0008385A)
#define BUS_CS6REC_ADDR ((volatile uint16_t*)0x0008386A)
#define BUS_CS7REC_ADDR ((volatile uint16_t*)0x0008387A)
#define BUS_CSNREC_RRCV_0 0x0
#define BUS_CSNREC_RRCV_1 0x1
#define BUS_CSNREC_RRCV_2 0x2
#define BUS_CSNREC_RRCV_3 0x3
#define BUS_CSNREC_RRCV_4 0x4
#define BUS_CSNREC_RRCV_5 0x5
#define BUS_CSNREC_RRCV_6 0x6
#define BUS_CSNREC_RRCV_7 0x7
#define BUS_CSNREC_RRCV_8 0x8
#define BUS_CSNREC_RRCV_9 0x9
#define BUS_CSNREC_RRCV_10 0xA
#define BUS_CSNREC_RRCV_11 0xB
#define BUS_CSNREC_RRCV_12 0xC
#define BUS_CSNREC_RRCV_13 0xD
#define BUS_CSNREC_RRCV_14 0xE
#define BUS_CSNREC_RRCV_15 0xF
#define BUS_CSNREC_WRCV_0 0x000
#define BUS_CSNREC_WRCV_1 0x100
#define BUS_CSNREC_WRCV_2 0x200
#define BUS_CSNREC_WRCV_3 0x300
#define BUS_CSNREC_WRCV_4 0x400
#define BUS_CSNREC_WRCV_5 0x500
#define BUS_CSNREC_WRCV_6 0x600
#define BUS_CSNREC_WRCV_7 0x700
#define BUS_CSNREC_WRCV_8 0x800
#define BUS_CSNREC_WRCV_9 0x900
#define BUS_CSNREC_WRCV_10 0xA00
#define BUS_CSNREC_WRCV_11 0xB00
#define BUS_CSNREC_WRCV_12 0xC00
#define BUS_CSNREC_WRCV_13 0xD00
#define BUS_CSNREC_WRCV_14 0xE00
#define BUS_CSNREC_WRCV_15 0xF00
//CS recovery cycle insert enable
#define BUS_CSRECEN_ADDR ((volatile uint16_t)0x00083880)
#define BUS_CSRECEN_RCVEN0 0x1
#define BUS_CSRECEN_RCVEN1 0x2
#define BUS_CSRECEN_RCVEN2 0x3
#define BUS_CSRECEN_RCVEN3 0x4
#define BUS_CSRECEN_RCVEN4 0x10
#define BUS_CSRECEN_RCVEN5 0x20
#define BUS_CSRECEN_RCVEN6 0x40
#define BUS_CSRECEN_RCVEN7 0x80
#define BUS_CSRECEN_RCVENM0 0x100
#define BUS_CSRECEN_RCVENM1 0x200
#define BUS_CSRECEN_RCVENM2 0x400
#define BUS_CSRECEN_RCVENM3 0x800
#define BUS_CSRECEN_RCVENM4 0x1000
#define BUS_CSRECEN_RCVENM5 0x2000
#define BUS_CSRECEN_RCVENM6 0x4000
#define BUS_CSRECEN_RCVENM7 0x8000
//CSn mode register
#define BUS_CS0MOD_ADDR ((volatile uint16_t*)0x00083002)
#define BUS_CS1MOD_ADDR ((volatile uint16_t*)0x00083012)
#define BUS_CS2MOD_ADDR ((volatile uint16_t*)0x00083022)
#define BUS_CS3MOD_ADDR ((volatile uint16_t*)0x00083032)
#define BUS_CS4MOD_ADDR ((volatile uint16_t*)0x00083042)
#define BUS_CS5MOD_ADDR ((volatile uint16_t*)0x00083052)
#define BUS_CS6MOD_ADDR ((volatile uint16_t*)0x00083062)
#define BUS_CS7MOD_ADDR ((volatile uint16_t*)0x00083072)
#define BUS_CSNMOD_WRMOD_BYTEST 0x0
#define BUS_CSNMOD_WRMOD_1WRST 0x1
#define BUS_CSNMOD_EWENB_EN 0x8
#define BUS_CSNMOD_EWENB_DIS 0x0
#define BUS_CSNMOD_PRENB_EN 0x100
#define BUS_CSNMOD_PRENB_DIS 0x0
#define BUS_CSNMOD_PWENB_EN 0x200
#define BUS_CSNMOD_PWENB_DIS 0x0
#define BUS_CSNMOD_PRMOD_NOMAL 0x0
#define BUS_CSNMOD_PRMOD_EXSEQ 0x8000

#define BUS_CS0WCR1_ADDR ((volatile uint32_t*)0x00083004)
#define BUS_CS1WCR1_ADDR ((volatile uint32_t*)0x00083014)
#define BUS_CS2WCR1_ADDR ((volatile uint32_t*)0x00083024)
#define BUS_CS3WCR1_ADDR ((volatile uint32_t*)0x00083034)
#define BUS_CS4WCR1_ADDR ((volatile uint32_t*)0x00083044)
#define BUS_CS5WCR1_ADDR ((volatile uint32_t*)0x00083054)
#define BUS_CS6WCR1_ADDR ((volatile uint32_t*)0x00083064)
#define BUS_CS7WCR1_ADDR ((volatile uint32_t*)0x00083074)
#define BUS_CSNWCR1_CSPWWAIT_0 0x0
#define BUS_CSNWCR1_CSPWWAIT_1 0x1
#define BUS_CSNWCR1_CSPWWAIT_2 0x2
#define BUS_CSNWCR1_CSPWWAIT_3 0x3
#define BUS_CSNWCR1_CSPWWAIT_4 0x4
#define BUS_CSNWCR1_CSPWWAIT_5 0x5
#define BUS_CSNWCR1_CSPWWAIT_6 0x6
#define BUS_CSNWCR1_CSPWWAIT_7 0x7
#define BUS_CSNWCR1_CSPRWAIT_0 0x000
#define BUS_CSNWCR1_CSPRWAIT_1 0x100
#define BUS_CSNWCR1_CSPRWAIT_2 0x200
#define BUS_CSNWCR1_CSPRWAIT_3 0x300
#define BUS_CSNWCR1_CSPRWAIT_4 0x400
#define BUS_CSNWCR1_CSPRWAIT_5 0x500
#define BUS_CSNWCR1_CSPRWAIT_6 0x600
#define BUS_CSNWCR1_CSPRWAIT_7 0x700

#define BUS_CSNWCR1_CSWWAIT_0 0x00000
#define BUS_CSNWCR1_CSWWAIT_1 0x10000
#define BUS_CSNWCR1_CSWWAIT_2 0x20000
#define BUS_CSNWCR1_CSWWAIT_3 0x30000
#define BUS_CSNWCR1_CSWWAIT_4 0x40000
#define BUS_CSNWCR1_CSWWAIT_5 0x50000
#define BUS_CSNWCR1_CSWWAIT_6 0x60000
#define BUS_CSNWCR1_CSWWAIT_7 0x70000
#define BUS_CSNWCR1_CSWWAIT_8 0x80000
#define BUS_CSNWCR1_CSWWAIT_9 0x90000
#define BUS_CSNWCR1_CSWWAIT_10 0xA0000
#define BUS_CSNWCR1_CSWWAIT_11 0xB0000
#define BUS_CSNWCR1_CSWWAIT_12 0xC0000
#define BUS_CSNWCR1_CSWWAIT_13 0xD0000
#define BUS_CSNWCR1_CSWWAIT_14 0xE0000
#define BUS_CSNWCR1_CSWWAIT_15 0xF0000
#define BUS_CSNWCR1_CSWWAIT_16 0x100000
#define BUS_CSNWCR1_CSWWAIT_17 0x110000
#define BUS_CSNWCR1_CSWWAIT_18 0x120000
#define BUS_CSNWCR1_CSWWAIT_19 0x130000
#define BUS_CSNWCR1_CSWWAIT_20 0x140000
#define BUS_CSNWCR1_CSWWAIT_21 0x150000
#define BUS_CSNWCR1_CSWWAIT_22 0x160000
#define BUS_CSNWCR1_CSWWAIT_23 0x170000
#define BUS_CSNWCR1_CSWWAIT_24 0x180000
#define BUS_CSNWCR1_CSWWAIT_25 0x190000
#define BUS_CSNWCR1_CSWWAIT_26 0x1A0000
#define BUS_CSNWCR1_CSWWAIT_27 0x1B0000
#define BUS_CSNWCR1_CSWWAIT_28 0x1C0000
#define BUS_CSNWCR1_CSWWAIT_29 0x1D0000
#define BUS_CSNWCR1_CSWWAIT_30 0x1E0000
#define BUS_CSNWCR1_CSWWAIT_31 0x1F0000

#define BUS_CSNWCR1_CSRWAIT_0 0x0000000
#define BUS_CSNWCR1_CSRWAIT_1 0x1000000
#define BUS_CSNWCR1_CSRWAIT_2 0x2000000
#define BUS_CSNWCR1_CSRWAIT_3 0x3000000
#define BUS_CSNWCR1_CSRWAIT_4 0x4000000
#define BUS_CSNWCR1_CSRWAIT_5 0x5000000
#define BUS_CSNWCR1_CSRWAIT_6 0x6000000
#define BUS_CSNWCR1_CSRWAIT_7 0x7000000
#define BUS_CSNWCR1_CSRWAIT_8 0x8000000
#define BUS_CSNWCR1_CSRWAIT_9 0x9000000
#define BUS_CSNWCR1_CSRWAIT_10 0xA000000
#define BUS_CSNWCR1_CSRWAIT_11 0xB000000
#define BUS_CSNWCR1_CSRWAIT_12 0xC000000
#define BUS_CSNWCR1_CSRWAIT_13 0xD000000
#define BUS_CSNWCR1_CSRWAIT_14 0xE000000
#define BUS_CSNWCR1_CSRWAIT_15 0xF000000
#define BUS_CSNWCR1_CSRWAIT_16 0x10000000
#define BUS_CSNWCR1_CSRWAIT_17 0x11000000
#define BUS_CSNWCR1_CSRWAIT_18 0x12000000
#define BUS_CSNWCR1_CSRWAIT_19 0x13000000
#define BUS_CSNWCR1_CSRWAIT_20 0x14000000
#define BUS_CSNWCR1_CSRWAIT_21 0x15000000
#define BUS_CSNWCR1_CSRWAIT_22 0x16000000
#define BUS_CSNWCR1_CSRWAIT_23 0x17000000
#define BUS_CSNWCR1_CSRWAIT_24 0x18000000
#define BUS_CSNWCR1_CSRWAIT_25 0x19000000
#define BUS_CSNWCR1_CSRWAIT_26 0x1A000000
#define BUS_CSNWCR1_CSRWAIT_27 0x1B000000
#define BUS_CSNWCR1_CSRWAIT_28 0x1C000000
#define BUS_CSNWCR1_CSRWAIT_29 0x1D000000
#define BUS_CSNWCR1_CSRWAIT_30 0x1E000000
#define BUS_CSNWCR1_CSRWAIT_31 0x1F000000

#define BUS_CS0WCR2_ADDR ((volatile uint32_t*)0x00083008)
#define BUS_CS1WCR2_ADDR ((volatile uint32_t*)0x00083018)
#define BUS_CS2WCR2_ADDR ((volatile uint32_t*)0x00083028)
#define BUS_CS3WCR2_ADDR ((volatile uint32_t*)0x00083038)
#define BUS_CS4WCR2_ADDR ((volatile uint32_t*)0x00083048)
#define BUS_CS5WCR2_ADDR ((volatile uint32_t*)0x00083058)
#define BUS_CS6WCR2_ADDR ((volatile uint32_t*)0x00083068)
#define BUS_CS7WCR2_ADDR ((volatile uint32_t*)0x00083078)
#define BUS_CSNWCR2_CSROFF_0 0x0
#define BUS_CSNWCR2_CSROFF_1 0x1
#define BUS_CSNWCR2_CSROFF_2 0x2
#define BUS_CSNWCR2_CSROFF_3 0x3
#define BUS_CSNWCR2_CSROFF_4 0x4
#define BUS_CSNWCR2_CSROFF_5 0x5
#define BUS_CSNWCR2_CSROFF_6 0x6
#define BUS_CSNWCR2_CSROFF_7 0x7
#define BUS_CSNWCR2_CSWOFF_0 0x0
#define BUS_CSNWCR2_CSWOFF_1 0x10
#define BUS_CSNWCR2_CSWOFF_2 0x20
#define BUS_CSNWCR2_CSWOFF_3 0x30
#define BUS_CSNWCR2_CSWOFF_4 0x40
#define BUS_CSNWCR2_CSWOFF_5 0x50
#define BUS_CSNWCR2_CSWOFF_6 0x60
#define BUS_CSNWCR2_CSWOFF_7 0x70
#define BUS_CSNWCR2_WDOFF_0 0x000
#define BUS_CSNWCR2_WDOFF_1 0x100
#define BUS_CSNWCR2_WDOFF_2 0x200
#define BUS_CSNWCR2_WDOFF_3 0x300
#define BUS_CSNWCR2_WDOFF_4 0x400
#define BUS_CSNWCR2_WDOFF_5 0x500
#define BUS_CSNWCR2_WDOFF_6 0x600
#define BUS_CSNWCR2_WDOFF_7 0x700
#define BUS_CSNWCR2_AWAIT_0 0x0000
#define BUS_CSNWCR2_AWAIT_1 0x1000
#define BUS_CSNWCR2_AWAIT_2 0x2000
#define BUS_CSNWCR2_AWAIT_3 0x3000
#define BUS_CSNWCR2_RDON_0 0x00000
#define BUS_CSNWCR2_RDON_1 0x10000
#define BUS_CSNWCR2_RDON_2 0x20000
#define BUS_CSNWCR2_RDON_3 0x30000
#define BUS_CSNWCR2_RDON_4 0x40000
#define BUS_CSNWCR2_RDON_5 0x50000
#define BUS_CSNWCR2_RDON_6 0x60000
#define BUS_CSNWCR2_RDON_7 0x70000
#define BUS_CSNWCR2_WRON_0 0x000000
#define BUS_CSNWCR2_WRON_1 0x100000
#define BUS_CSNWCR2_WRON_2 0x200000
#define BUS_CSNWCR2_WRON_3 0x300000
#define BUS_CSNWCR2_WRON_4 0x400000
#define BUS_CSNWCR2_WRON_5 0x500000
#define BUS_CSNWCR2_WRON_6 0x600000
#define BUS_CSNWCR2_WRON_7 0x700000
#define BUS_CSNWCR2_WDON_0 0x0000000
#define BUS_CSNWCR2_WDON_1 0x1000000
#define BUS_CSNWCR2_WDON_2 0x2000000
#define BUS_CSNWCR2_WDON_3 0x3000000
#define BUS_CSNWCR2_WDON_4 0x4000000
#define BUS_CSNWCR2_WDON_5 0x5000000
#define BUS_CSNWCR2_WDON_6 0x6000000
#define BUS_CSNWCR2_WDON_7 0x7000000
#define BUS_CSNWCR2_CSON_0 0x00000000
#define BUS_CSNWCR2_CSON_1 0x10000000
#define BUS_CSNWCR2_CSON_2 0x20000000
#define BUS_CSNWCR2_CSON_3 0x30000000
#define BUS_CSNWCR2_CSON_4 0x40000000
#define BUS_CSNWCR2_CSON_5 0x50000000
#define BUS_CSNWCR2_CSON_6 0x60000000
#define BUS_CSNWCR2_CSON_7 0x70000000
//SDC control register
#define BUS_SDCCR_ADDR ((volatile uint8_t*)0x00083C00)
#define BUS_SDCCR_EXENB_EN 0x1
#define BUS_SDCCR_EXENB_DIS 0x0
#define BUS_SDCCR_BSIZE_16 0x00
#define BUS_SDCCR_BSIZE_16 0x00
#define BUS_SDCCR_BSIZE_32 0x10
#define BUS_SDCCR_BSIZE_8 0x20
//SDC mode register
#define BUS_SDCMOD_ADDR ((volatile uint8_t*)0x00083C01)
#define BUS_SDCMOD_EMODE_SAME 0x0
#define BUS_SDCMOD_EMODE_DIFF 0x1
//SDRAM access mode register
#define BUS_SDAMOD_ADDR ((volatile uint8_t*)0x00083C02)
#define BUS_SDAMOD_BE_DIS 0x0
#define BUS_SDAMOD_BE_EN 0x1
//SDRAM self refresh control register
#define BUS_ADSELF_ADDR ((volatile uint8_t*)0x00083C10)
#define BUS_SDAMOD_SFEN_DIS 0x0
#define BUS_SDAMOD_SFEN_EN 0x1
//SDRAM refresh control register
#define BUS_SFRFCR_ADDR ((volatile uint16_t*)0x00083C14)
#define BUS_SFRFCR_REFW_1 0x0000
#define BUS_SFRFCR_REFW_2 0x1000
#define BUS_SFRFCR_REFW_3 0x2000
#define BUS_SFRFCR_REFW_4 0x3000
#define BUS_SFRFCR_REFW_5 0x4000
#define BUS_SFRFCR_REFW_6 0x5000
#define BUS_SFRFCR_REFW_7 0x6000
#define BUS_SFRFCR_REFW_8 0x7000
#define BUS_SFRFCR_REFW_9 0x8000
#define BUS_SFRFCR_REFW_10 0x9000
#define BUS_SFRFCR_REFW_11 0xA000
#define BUS_SFRFCR_REFW_12 0xB000
#define BUS_SFRFCR_REFW_13 0xC000
#define BUS_SFRFCR_REFW_14 0xD000
#define BUS_SFRFCR_REFW_15 0xE000
#define BUS_SFRFCR_REFW_16 0xF000
//SDRAM auto refresh control register
#define BUS_SDREFEN_ADDR ((volatile uint8_t*)0x00083C16)
#define BUS_SDREFEN_RFEN_DIS 0x0
#define BUS_SDREFEN_RFEN_EN 0x1
//SDRAM initialize sequence control regiset
#define BUS_SDICR_ADDR ((volatile uint8_t*)0x00083C20)
#define BUS_SDICR_INIRQ_START 0x1
//SDRAM initialize register
#define BUS_SDIR_ADDR ((volatile uint16_t*)0x00083C24)
#define BUS_SDIR_ARFI_3 0x0
#define BUS_SDIR_ARFI_4 0x1
#define BUS_SDIR_ARFI_5 0x2
#define BUS_SDIR_ARFI_6 0x3
#define BUS_SDIR_ARFI_7 0x4
#define BUS_SDIR_ARFI_8 0x5
#define BUS_SDIR_ARFI_9 0x6
#define BUS_SDIR_ARFI_10 0x7
#define BUS_SDIR_ARFI_11 0x8
#define BUS_SDIR_ARFI_12 0x9
#define BUS_SDIR_ARFI_13 0xA
#define BUS_SDIR_ARFI_14 0xB
#define BUS_SDIR_ARFI_15 0xC
#define BUS_SDIR_ARFI_16 0xD
#define BUS_SDIR_ARFI_17 0xE
#define BUS_SDIR_ARFI_18 0xF
#define BUS_SDIR_ARFC_1 0x10
#define BUS_SDIR_ARFC_2 0x20
#define BUS_SDIR_ARFC_3 0x30
#define BUS_SDIR_ARFC_4 0x40
#define BUS_SDIR_ARFC_5 0x50
#define BUS_SDIR_ARFC_6 0x60
#define BUS_SDIR_ARFC_7 0x70
#define BUS_SDIR_ARFC_8 0x80
#define BUS_SDIR_ARFC_9 0x90
#define BUS_SDIR_ARFC_10 0xA0
#define BUS_SDIR_ARFC_11 0xB0
#define BUS_SDIR_ARFC_12 0xC0
#define BUS_SDIR_ARFC_13 0xD0
#define BUS_SDIR_ARFC_14 0xE0
#define BUS_SDIR_ARFC_15 0xF0
#define BUS_SDIR_PRC_3 0x000
#define BUS_SDIR_PRC_4 0x100
#define BUS_SDIR_PRC_5 0x200
#define BUS_SDIR_PRC_6 0x300
#define BUS_SDIR_PRC_7 0x400
#define BUS_SDIR_PRC_8 0x500
#define BUS_SDIR_PRC_9 0x600
#define BUS_SDIR_PRC_10 0x700
//SDRAM address register
#define BUS_SDADR_ADDR ((volatile uint8_t*)0x00083C40)
#define BUS_SDADR_MXC_8 0x0
#define BUS_SDADR_MXC_9 0x1
#define BUS_SDADR_MXC_10 0x2
#define BUS_SDADR_MXC_11 0x3
//SDRAM timing register
#define BUS_SDTR_ADDR ((volatile uint32_t*)0x00083C44)
#define BUS_SDTR_CL_1 0x1
#define BUS_SDTR_CL_2 0x2
#define BUS_SDTR_CL_3 0x3
#define BUS_SDTR_WR_1 0x0
#define BUS_SDTR_WR_2 0x100
#define BUS_SDTR_RP_1  0x000
#define BUS_SDTR_RP_2  0x200
#define BUS_SDTR_RP_3  0x400
#define BUS_SDTR_RP_4  0x600
#define BUS_SDTR_RP_5  0x800
#define BUS_SDTR_RP_6  0xA00
#define BUS_SDTR_RP_7  0xC00
#define BUS_SDTR_RP_8  0xE00
#define BUS_SDTR_RCD_1 0x0000
#define BUS_SDTR_RCD_2 0x1000
#define BUS_SDTR_RCD_3 0x2000
#define BUS_SDTR_RCD_4 0x3000
#define BUS_SDTR_RAS_1 0x00000
#define BUS_SDTR_RAS_2 0x10000
#define BUS_SDTR_RAS_3 0x20000
#define BUS_SDTR_RAS_4 0x30000
#define BUS_SDTR_RAS_5 0x40000
#define BUS_SDTR_RAS_6 0x50000
#define BUS_SDTR_RAS_7 0x60000
//SDRAM mode register
#define BUS_SDMOD_ADDR ((volatile uint16_t*)0x00083C48)
//SDRAM status register
#define BUS_SDSR_ADDR ((volatile uint8_t*)0x00083C50)
#define BUS_SDSR_MRSST 0x1
#define BUS_SDSR_INIST 0x10
#define BUS_SDSR_SRFST 0x20
//bus error status clear register
#define BUS_BERCLR_ADDR ((volatile uint8_t*)0x00081300)
#define BUS_BERCLR_STSCLR 0x1
//bus error moniter enable register
#define BUS_BEREN_ADDR ((volatile uint8_t*)0x00081304)
#define BUS_BEREN_IGAEN_EN 0x1
#define BUS_BEREN_IGAEN_DIS 0x0
#define BUS_BEREN_TOEN_EN 0x2
#define BUS_BEREN_TOEN_DIS 0x0
//bus error status register 1
#define BUS_BERSR1_ADDR ((volatile uint8_t*)0x00081308)
#define BUS_BERSR1_IA 0x1
#define BUS_BERSR1_TO 0x2
#define BUS_BERSR1_MST_MASK 0x70
#define BUS_BERSR1_MST_CPU 0x00
#define BUS_BERSR1_MST_DTC_DMAC 0x30
#define BUS_BERSR1_MST_EDMAC 0x60
#define BUS_BERSR1_MST_EXDMAC 0x70
//bus error status register2
#define BUS_ADDR_ADDR ((volatile uint16_t*)0x0008130A)
//bus priority control register
#define BUS_BUSPRI_ADDR ((volatile uint16_t*)0x00081310)
#define BUS_BUSPRI_BPRA_CONST 0x0
#define BUS_BUSPRI_BPRA_TOGGL 0x1
#define BUS_BUSPRI_BPRO_CONST 0x0
#define BUS_BUSPRI_BPRO_TOGGL 0x4
#define BUS_BUSPRI_BPIB_CONST 0x00
#define BUS_BUSPRI_BPIB_TOGGL 0x10
#define BUS_BUSPRI_BPGB_CONST 0x00
#define BUS_BUSPRI_BPGB_TOGGL 0x40
#define BUS_BUSPRI_BPHB_CONST 0x000
#define BUS_BUSPRI_BPHB_TOGGL 0x100
#define BUS_BUSPRI_BPFB_CONST 0x000
#define BUS_BUSPRI_BPFB_TOGGL 0x400
#define BUS_BUSPRI_BPEB_CONST 0x0000
#define BUS_BUSPRI_BPEB_TOGGL 0x1000

