wolfssl-jp/TOPPERS-ASP/asp/arch/rx_gcc/rx72n/rx72n.h
/*
 * 割り込み要求レジスタ
 */

#define ICU_IR_BASE 0x00087000
#define ICU_IR_BIT				( 1U << 0U )


/*
 * 割り込み要求許可レジスタ
 */
#define ICU_IER_BASE 0x00087200


/*
 * 割り込み要因プライオリティレジスタi(i=00h〜8Fh)の設定
 */
#define ICU_IPR_BASE  0x00087300
#define ICU_IPR00_OFFSET 0
#define ICU_IPR01_OFFSET 1
#define ICU_IPR02_OFFSET 2
#define ICU_IPR03_OFFSET 3
#define ICU_IPR04_OFFSET 4
#define ICU_IPR05_OFFSET 5
#define ICU_IPR06_OFFSET 6
#define ICU_IPR07_OFFSET 7
#define ICU_IPR08_OFFSET 8
#define ICU_IPR09_OFFSET 9
#define ICU_IPR0A_OFFSET 10
#define ICU_IPR0B_OFFSET 11
#define ICU_IPR0C_OFFSET 12
#define ICU_IPR0D_OFFSET 13
#define ICU_IPR0E_OFFSET 14
#define ICU_IPR0F_OFFSET 15
#define ICU_IPR10_OFFSET 16
#define ICU_IPR11_OFFSET 17
#define ICU_IPR12_OFFSET 18
#define ICU_IPR13_OFFSET 19
#define ICU_IPR14_OFFSET 20
#define ICU_IPR15_OFFSET 21
#define ICU_IPR16_OFFSET 22
#define ICU_IPR17_OFFSET 23
#define ICU_IPR18_OFFSET 24
#define ICU_IPR19_OFFSET 25
#define ICU_IPR1A_OFFSET 26
#define ICU_IPR1B_OFFSET 27
#define ICU_IPR1C_OFFSET 28
#define ICU_IPR1D_OFFSET 29
#define ICU_IPR1E_OFFSET 30
#define ICU_IPR1F_OFFSET 31
#define ICU_IPR20_OFFSET 32
#define ICU_IPR21_OFFSET 33
#define ICU_IPR22_OFFSET 34
#define ICU_IPR23_OFFSET 35
#define ICU_IPR24_OFFSET 36
#define ICU_IPR25_OFFSET 37
#define ICU_IPR26_OFFSET 38
#define ICU_IPR27_OFFSET 39
#define ICU_IPR28_OFFSET 40
#define ICU_IPR29_OFFSET 41
#define ICU_IPR2A_OFFSET 42
#define ICU_IPR2B_OFFSET 43
#define ICU_IPR2C_OFFSET 44
#define ICU_IPR2D_OFFSET 45
#define ICU_IPR2E_OFFSET 46
#define ICU_IPR2F_OFFSET 47
#define ICU_IPR30_OFFSET 48
#define ICU_IPR31_OFFSET 49
#define ICU_IPR32_OFFSET 50
#define ICU_IPR33_OFFSET 51
#define ICU_IPR34_OFFSET 52
#define ICU_IPR35_OFFSET 53
#define ICU_IPR36_OFFSET 54
#define ICU_IPR37_OFFSET 55
#define ICU_IPR38_OFFSET 56
#define ICU_IPR39_OFFSET 57
#define ICU_IPR3A_OFFSET 58
#define ICU_IPR3B_OFFSET 59
#define ICU_IPR3C_OFFSET 60
#define ICU_IPR3D_OFFSET 61
#define ICU_IPR3E_OFFSET 62
#define ICU_IPR3F_OFFSET 63
#define ICU_IPR40_OFFSET 64
#define ICU_IPR41_OFFSET 65
#define ICU_IPR42_OFFSET 66
#define ICU_IPR43_OFFSET 67
#define ICU_IPR44_OFFSET 68
#define ICU_IPR45_OFFSET 69
#define ICU_IPR46_OFFSET 70
#define ICU_IPR47_OFFSET 71
#define ICU_IPR48_OFFSET 72
#define ICU_IPR49_OFFSET 73
#define ICU_IPR4A_OFFSET 74
#define ICU_IPR4B_OFFSET 75
#define ICU_IPR4C_OFFSET 76
#define ICU_IPR4D_OFFSET 77
#define ICU_IPR4E_OFFSET 78
#define ICU_IPR4F_OFFSET 79
#define ICU_IPR50_OFFSET 80
#define ICU_IPR51_OFFSET 81
#define ICU_IPR52_OFFSET 82
#define ICU_IPR53_OFFSET 83
#define ICU_IPR54_OFFSET 84
#define ICU_IPR55_OFFSET 85
#define ICU_IPR56_OFFSET 86
#define ICU_IPR57_OFFSET 87
#define ICU_IPR58_OFFSET 88
#define ICU_IPR59_OFFSET 89
#define ICU_IPR5A_OFFSET 90
#define ICU_IPR5B_OFFSET 91
#define ICU_IPR5C_OFFSET 92
#define ICU_IPR5D_OFFSET 93
#define ICU_IPR5E_OFFSET 94
#define ICU_IPR5F_OFFSET 95
#define ICU_IPR60_OFFSET 96
#define ICU_IPR61_OFFSET 97
#define ICU_IPR62_OFFSET 98
#define ICU_IPR63_OFFSET 99
#define ICU_IPR64_OFFSET 100
#define ICU_IPR65_OFFSET 101
#define ICU_IPR66_OFFSET 102
#define ICU_IPR67_OFFSET 103
#define ICU_IPR68_OFFSET 104
#define ICU_IPR69_OFFSET 105
#define ICU_IPR6A_OFFSET 106
#define ICU_IPR6B_OFFSET 107
#define ICU_IPR6C_OFFSET 108
#define ICU_IPR6D_OFFSET 109
#define ICU_IPR6E_OFFSET 110
#define ICU_IPR6F_OFFSET 111
#define ICU_IPR70_OFFSET 112
#define ICU_IPR71_OFFSET 113
#define ICU_IPR72_OFFSET 114
#define ICU_IPR73_OFFSET 115
#define ICU_IPR74_OFFSET 116
#define ICU_IPR75_OFFSET 117
#define ICU_IPR76_OFFSET 118
#define ICU_IPR77_OFFSET 119
#define ICU_IPR78_OFFSET 120
#define ICU_IPR79_OFFSET 121
#define ICU_IPR7A_OFFSET 122
#define ICU_IPR7B_OFFSET 123
#define ICU_IPR7C_OFFSET 124
#define ICU_IPR7D_OFFSET 125
#define ICU_IPR7E_OFFSET 126
#define ICU_IPR7F_OFFSET 127
#define ICU_IPR80_OFFSET 128
#define ICU_IPR81_OFFSET 129
#define ICU_IPR82_OFFSET 130
#define ICU_IPR83_OFFSET 131
#define ICU_IPR84_OFFSET 132
#define ICU_IPR85_OFFSET 133
#define ICU_IPR86_OFFSET 134
#define ICU_IPR87_OFFSET 135
#define ICU_IPR88_OFFSET 136
#define ICU_IPR89_OFFSET 137
#define ICU_IPR8A_OFFSET 138
#define ICU_IPR8B_OFFSET 139
#define ICU_IPR8C_OFFSET 140
#define ICU_IPR8D_OFFSET 141
#define ICU_IPR8E_OFFSET 142
#define ICU_IPR8F_OFFSET 143
#define ICU_IPR90_OFFSET 144
#define ICU_IPR91_OFFSET 145
#define ICU_IPR92_OFFSET 146
#define ICU_IPR93_OFFSET 147
#define ICU_IPR94_OFFSET 148
#define ICU_IPR95_OFFSET 149
#define ICU_IPR96_OFFSET 150
#define ICU_IPR97_OFFSET 151
#define ICU_IPR98_OFFSET 152
#define ICU_IPR99_OFFSET 153
#define ICU_IPR9A_OFFSET 154
#define ICU_IPR9B_OFFSET 155
#define ICU_IPR9C_OFFSET 156
#define ICU_IPR9D_OFFSET 157
#define ICU_IPR9E_OFFSET 158
#define ICU_IPR9F_OFFSET 159
#define ICU_IPRA0_OFFSET 160
#define ICU_IPRA1_OFFSET 161
#define ICU_IPRA2_OFFSET 162
#define ICU_IPRA3_OFFSET 163
#define ICU_IPRA4_OFFSET 164
#define ICU_IPRA5_OFFSET 165
#define ICU_IPRA6_OFFSET 166
#define ICU_IPRA7_OFFSET 167
#define ICU_IPRA8_OFFSET 168
#define ICU_IPRA9_OFFSET 169
#define ICU_IPRAA_OFFSET 170
#define ICU_IPRAB_OFFSET 171
#define ICU_IPRAC_OFFSET 172
#define ICU_IPRAD_OFFSET 173
#define ICU_IPRAE_OFFSET 174
#define ICU_IPRAF_OFFSET 175
#define ICU_IPRB0_OFFSET 176
#define ICU_IPRB1_OFFSET 177
#define ICU_IPRB2_OFFSET 178
#define ICU_IPRB3_OFFSET 179
#define ICU_IPRB4_OFFSET 180
#define ICU_IPRB5_OFFSET 181
#define ICU_IPRB6_OFFSET 182
#define ICU_IPRB7_OFFSET 183
#define ICU_IPRB8_OFFSET 184
#define ICU_IPRB9_OFFSET 185
#define ICU_IPRBA_OFFSET 186
#define ICU_IPRBB_OFFSET 187
#define ICU_IPRBC_OFFSET 188
#define ICU_IPRBD_OFFSET 189
#define ICU_IPRBE_OFFSET 190
#define ICU_IPRBF_OFFSET 191
#define ICU_IPRC0_OFFSET 192
#define ICU_IPRC1_OFFSET 193
#define ICU_IPRC2_OFFSET 194
#define ICU_IPRC3_OFFSET 195
#define ICU_IPRC4_OFFSET 196
#define ICU_IPRC5_OFFSET 197
#define ICU_IPRC6_OFFSET 198
#define ICU_IPRC7_OFFSET 199
#define ICU_IPRC8_OFFSET 200
#define ICU_IPRC9_OFFSET 201
#define ICU_IPRCA_OFFSET 202
#define ICU_IPRCB_OFFSET 203
#define ICU_IPRCC_OFFSET 204
#define ICU_IPRCD_OFFSET 205
#define ICU_IPRCE_OFFSET 206
#define ICU_IPRCF_OFFSET 207
#define ICU_IPRD0_OFFSET 208
#define ICU_IPRD1_OFFSET 209
#define ICU_IPRD2_OFFSET 210
#define ICU_IPRD3_OFFSET 211
#define ICU_IPRD4_OFFSET 212
#define ICU_IPRD5_OFFSET 213
#define ICU_IPRD6_OFFSET 214
#define ICU_IPRD7_OFFSET 215
#define ICU_IPRD8_OFFSET 216
#define ICU_IPRD9_OFFSET 217
#define ICU_IPRDA_OFFSET 218
#define ICU_IPRDB_OFFSET 219
#define ICU_IPRDC_OFFSET 220
#define ICU_IPRDD_OFFSET 221
#define ICU_IPRDE_OFFSET 222
#define ICU_IPRDF_OFFSET 223
#define ICU_IPRE0_OFFSET 224
#define ICU_IPRE1_OFFSET 225
#define ICU_IPRE2_OFFSET 226
#define ICU_IPRE3_OFFSET 227
#define ICU_IPRE4_OFFSET 228
#define ICU_IPRE5_OFFSET 229
#define ICU_IPRE6_OFFSET 230
#define ICU_IPRE7_OFFSET 231
#define ICU_IPRE8_OFFSET 232
#define ICU_IPRE9_OFFSET 233
#define ICU_IPREA_OFFSET 234
#define ICU_IPREB_OFFSET 235
#define ICU_IPREC_OFFSET 236
#define ICU_IPRED_OFFSET 237
#define ICU_IPREE_OFFSET 238
#define ICU_IPREF_OFFSET 239
#define ICU_IPRF0_OFFSET 240
#define ICU_IPRF1_OFFSET 241
#define ICU_IPRF2_OFFSET 242
#define ICU_IPRF3_OFFSET 243
#define ICU_IPRF4_OFFSET 244
#define ICU_IPRF5_OFFSET 245
#define ICU_IPRF6_OFFSET 246
#define ICU_IPRF7_OFFSET 247
#define ICU_IPRF8_OFFSET 248
#define ICU_IPRF9_OFFSET 249
#define ICU_IPRFA_OFFSET 250
#define ICU_IPRFB_OFFSET 251
#define ICU_IPRFC_OFFSET 252
#define ICU_IPRFD_OFFSET 253
#define ICU_IPRFE_OFFSET 254
#define ICU_IPRFF_OFFSET 255
#define ICU_IPR_BIT				( 7U << 0U )

