wolfssl-jp/TOPPERS-ASP/asp/arch/rx_gcc/rx72n/rx72n.h
/*
 * DTCER Register
 */
#define ICU_DTCER_BASE 0x00087100
#define EN_ICU_DTCER_BIT 0x1
#define DIS_ICU_DTCER_BIT 0x0

#ifndef TOPPERS_MACRO_ONLY
#define ENABLE_ICU_DTCER(intno)  (*((volatile uint8_t *)(ICU_DTCER_BASE + intno)) = EN_ICU_DTCER_BIT)

#define DISABLE_ICU_DTCER(intno) (*((volatile uint8_t *)(ICU_DTCER_BASE + intno)) = DIS_ICU_DTCER_BIT)
#endif


#define ICU_IRQCR_BASE 0x00087500
#define SET_ICU_IRQCR(intno, sel_edge) (*((volatile uint8_t *)(ICU_IRQCR_BASE | intno)) = sel_edge)

/*
 * DTCa address define
 */

#define DTCA_BASE_ADDR 0x00082400

/*
 *  各チャンネルのレジスタ及び設定ビット情報
 */

#define CMT_CMSTR0_ADDR			( ( volatile uint16_t  * )0x00088000 )
#define CMT_CMSTR0_STR0_BIT		( 1U << 0U )
#define CMT_CMSTR0_STR1_BIT		( 1U << 1U )
#define CMT_CMSTR1_ADDR			( ( volatile uint16_t  * )0x00088010 )
#define CMT_CMSTR1_STR2_BIT		( 1U << 0U )
#define CMT_CMSTR1_STR3_BIT		( 1U << 1U )
#define CMT0_CMCR_ADDR			( ( volatile uint16_t  * )0x00088002 )
#define CMT0_CMCR_CKS_BIT		( 3U )
#define CMT0_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT1_CMCR_ADDR			( ( volatile uint16_t  * )0x00088008 )
#define CMT1_CMCR_CKS_BIT		( 3U )
#define CMT1_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT2_CMCR_ADDR			( ( volatile uint16_t  * )0x00088012 )
#define CMT2_CMCR_CKS_BIT		( 3U)
#define CMT2_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT3_CMCR_ADDR			( ( volatile uint16_t  * )0x00088018 )
#define CMT3_CMCR_CKS_BIT		( 3U )
#define CMT3_CMCR_CMIE_BIT		( 1U << 6U )
#define CMT0_CMCNT_ADDR			( ( volatile uint16_t  * )0x00088004 )
#define CMT1_CMCNT_ADDR			( ( volatile uint16_t  * )0x0008800A )
#define CMT2_CMCNT_ADDR			( ( volatile uint16_t  * )0x00088014 )
#define CMT3_CMCNT_ADDR			( ( volatile uint16_t  * )0x0008801A )
#define CMT0_CMCOR_ADDR			( ( volatile uint16_t  * )0x00088006 )
#define CMT1_CMCOR_ADDR			( ( volatile uint16_t  * )0x0008800C )
#define CMT2_CMCOR_ADDR			( ( volatile uint16_t  * )0x00088016 )
#define CMT3_CMCOR_ADDR			( ( volatile uint16_t  * )0x0008801C )

#define SCI0_SMR_ADDR			( ( volatile uint8_t  * )0x0008A000 )
#define SCI0_BRR_ADDR			( ( volatile uint8_t  * )0x0008A001 )
#define SCI0_SCR_ADDR			( ( volatile uint8_t  * )0x0008A002 )
#define SCI0_TDR_ADDR			( ( volatile uint8_t  * )0x0008A003 )
#define SCI0_SSR_ADDR			( ( volatile uint8_t  * )0x0008A004 )
#define SCI0_RDR_ADDR			( ( volatile uint8_t  * )0x0008A005 )
#define SCI0_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A006 )
#define SCI0_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A007 )
#define SCI1_SMR_ADDR			( ( volatile uint8_t  * )0x0008A020 )
#define SCI1_BRR_ADDR			( ( volatile uint8_t  * )0x0008A021 )
#define SCI1_SCR_ADDR			( ( volatile uint8_t  * )0x0008A022 )
#define SCI1_TDR_ADDR			( ( volatile uint8_t  * )0x0008A023 )
#define SCI1_SSR_ADDR			( ( volatile uint8_t  * )0x0008A024 )
#define SCI1_RDR_ADDR			( ( volatile uint8_t  * )0x0008A025 )
#define SCI1_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A026 )
#define SCI1_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A027 )
#define SCI2_SMR_ADDR			( ( volatile uint8_t  * )0x0008A040 )
#define SCI2_BRR_ADDR			( ( volatile uint8_t  * )0x0008A041 )
#define SCI2_SCR_ADDR			( ( volatile uint8_t  * )0x0008A042 )
#define SCI2_TDR_ADDR			( ( volatile uint8_t  * )0x0008A043 )
#define SCI2_SSR_ADDR			( ( volatile uint8_t  * )0x0008A044 )
#define SCI2_RDR_ADDR			( ( volatile uint8_t  * )0x0008A045 )
#define SCI2_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A046 )
#define SCI2_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A047 )
#define SCI3_SMR_ADDR			( ( volatile uint8_t  * )0x0008A060 )
#define SCI3_BRR_ADDR			( ( volatile uint8_t  * )0x0008A061 )
#define SCI3_SCR_ADDR			( ( volatile uint8_t  * )0x0008A062 )
#define SCI3_TDR_ADDR			( ( volatile uint8_t  * )0x0008A063 )
#define SCI3_SSR_ADDR			( ( volatile uint8_t  * )0x0008A064 )
#define SCI3_RDR_ADDR			( ( volatile uint8_t  * )0x0008A065 )
#define SCI3_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A066 )
#define SCI3_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A067 )
#define SCI4_SMR_ADDR			( ( volatile uint8_t  * )0x0008A080 )
#define SCI4_BRR_ADDR			( ( volatile uint8_t  * )0x0008A081 )
#define SCI4_SCR_ADDR			( ( volatile uint8_t  * )0x0008A082 )
#define SCI4_TDR_ADDR			( ( volatile uint8_t  * )0x0008A083 )
#define SCI4_SSR_ADDR			( ( volatile uint8_t  * )0x0008A084 )
#define SCI4_RDR_ADDR			( ( volatile uint8_t  * )0x0008A085 )
#define SCI4_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A086 )
#define SCI4_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A087 )
#define SCI5_SMR_ADDR			( ( volatile uint8_t  * )0x0008A0A0 )
#define SCI5_BRR_ADDR			( ( volatile uint8_t  * )0x0008A0A1 )
#define SCI5_SCR_ADDR			( ( volatile uint8_t  * )0x0008A0A2 )
#define SCI5_TDR_ADDR			( ( volatile uint8_t  * )0x0008A0A3 )
#define SCI5_SSR_ADDR			( ( volatile uint8_t  * )0x0008A0A4 )
#define SCI5_RDR_ADDR			( ( volatile uint8_t  * )0x0008A0A5 )
#define SCI5_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A0A6 )
#define SCI5_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A0A7 )
#define SCI6_SMR_ADDR			( ( volatile uint8_t  * )0x0008A0C0 )
#define SCI6_BRR_ADDR			( ( volatile uint8_t  * )0x0008A0C1 )
#define SCI6_SCR_ADDR			( ( volatile uint8_t  * )0x0008A0C2 )
#define SCI6_TDR_ADDR			( ( volatile uint8_t  * )0x0008A0C3 )
#define SCI6_SSR_ADDR			( ( volatile uint8_t  * )0x0008A0C4 )
#define SCI6_RDR_ADDR			( ( volatile uint8_t  * )0x0008A0C5 )
#define SCI6_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A0C6 )
#define SCI6_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A0C7 )
#define SCI7_SMR_ADDR			( ( volatile uint8_t  * )0x0008A0E0 )
#define SCI7_BRR_ADDR			( ( volatile uint8_t  * )0x0008A0E1 )
#define SCI7_SCR_ADDR			( ( volatile uint8_t  * )0x0008A0E2 )
#define SCI7_TDR_ADDR			( ( volatile uint8_t  * )0x0008A0E3 )
#define SCI7_SSR_ADDR			( ( volatile uint8_t  * )0x0008A0E4 )
#define SCI7_RDR_ADDR			( ( volatile uint8_t  * )0x0008A0E5 )
#define SCI7_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A0E6 )
#define SCI7_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A0E7 )
#define SCI8_SMR_ADDR			( ( volatile uint8_t  * )0x0008A100 )
#define SCI8_BRR_ADDR			( ( volatile uint8_t  * )0x0008A101 )
#define SCI8_SCR_ADDR			( ( volatile uint8_t  * )0x0008A102 )
#define SCI8_TDR_ADDR			( ( volatile uint8_t  * )0x0008A103 )
#define SCI8_SSR_ADDR			( ( volatile uint8_t  * )0x0008A104 )
#define SCI8_RDR_ADDR			( ( volatile uint8_t  * )0x0008A105 )
#define SCI8_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A106 )
#define SCI8_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A107 )
#define SCI9_SMR_ADDR			( ( volatile uint8_t  * )0x0008A120 )
#define SCI9_BRR_ADDR			( ( volatile uint8_t  * )0x0008A121 )
#define SCI9_SCR_ADDR			( ( volatile uint8_t  * )0x0008A122 )
#define SCI9_TDR_ADDR			( ( volatile uint8_t  * )0x0008A123 )
#define SCI9_SSR_ADDR			( ( volatile uint8_t  * )0x0008A124 )
#define SCI9_RDR_ADDR			( ( volatile uint8_t  * )0x0008A125 )
#define SCI9_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A126 )
#define SCI9_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A127 )
#define SCI10_SMR_ADDR			( ( volatile uint8_t  * )0x0008A140 )
#define SCI10_BRR_ADDR			( ( volatile uint8_t  * )0x0008A141 )
#define SCI10_SCR_ADDR			( ( volatile uint8_t  * )0x0008A142 )
#define SCI10_TDR_ADDR			( ( volatile uint8_t  * )0x0008A143 )
#define SCI10_SSR_ADDR			( ( volatile uint8_t  * )0x0008A144 )
#define SCI10_RDR_ADDR			( ( volatile uint8_t  * )0x0008A145 )
#define SCI10_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A146 )
#define SCI10_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A147 )
#define SCI11_SMR_ADDR			( ( volatile uint8_t  * )0x0008A160 )
#define SCI11_BRR_ADDR			( ( volatile uint8_t  * )0x0008A161 )
#define SCI11_SCR_ADDR			( ( volatile uint8_t  * )0x0008A162 )
#define SCI11_TDR_ADDR			( ( volatile uint8_t  * )0x0008A163 )
#define SCI11_SSR_ADDR			( ( volatile uint8_t  * )0x0008A164 )
#define SCI11_RDR_ADDR			( ( volatile uint8_t  * )0x0008A165 )
#define SCI11_SCMR_ADDR			( ( volatile uint8_t  * )0x0008A166 )
#define SCI11_SEMR_ADDR			( ( volatile uint8_t  * )0x0008A167 )
#define SCI_SMR_CKS_BIT			( 3U << 0U )
#define SCI_SMR_MP_BIT	        ( 1U << 2U )
#define SCI_SMR_STOP_BIT		( 1U << 3U )
#define SCI_SMR_PM_BIT			( 1U << 4U )
#define SCI_SMR_PE_BIT			( 1U << 5U )
#define SCI_SMR_CHR_BIT			( 1U << 6U )
#define SCI_SMR_CM_BIT			( 1U << 7U )
#define SCI_SCR_CKE_BIT			( 3U << 0U )
#define SCI_SCR_TEIE_BIT		( 1U << 2U )
#define SCI_SCR_MPIE_BIT		( 1U << 3U )
#define SCI_SCR_RE_BIT			( 1U << 4U )
#define SCI_SCR_TE_BIT			( 1U << 5U )
#define SCI_SCR_RIE_BIT			( 1U << 6U )
#define SCI_SCR_TIE_BIT			( 1U << 7U )
#define SCI_SSR_MPBT_BIT		( 1U << 0U )
#define SCI_SSR_MPB_BIT 		( 1U << 1U )
#define SCI_SSR_TEND_BIT		( 1U << 2U )
#define SCI_SSR_PER_BIT			( 1U << 3U )
#define SCI_SSR_FER_BIT			( 1U << 4U )
#define SCI_SSR_ORER_BIT		( 1U << 5U )
#define SCI_SCMR_SMIF_BIT		( 1U << 0U )
#define SCI_SCMR_SINV_BIT		( 1U << 2U )
#define SCI_SCMR_SDIR_BIT		( 1U << 3U )
#define SCI_SCMR_BCP2_BIT		( 1U << 7U )
#define SCI_SEMR_ACS0_BIT		( 1U << 0U )
#define SCI_SEMR_ABCS_BIT		( 1U << 4U )
#define SCI_SEMR_NFEN_BIT		( 1U << 5U )

