wolfssl-jp/TOPPERS-ASP/asp/arch/rx_gcc/rx72n/rx72n.h
/*
 * Multi function Pin Controler configration define
 */
#define MPC_PWPR_ADDR          ( ( volatile uint8_t  * )0x0008C11F )
#define MPC_PWPR_PFSWE_BIT     ( 1U << 6 )
#define MPC_PWPR_B0WI_BIT      ( 1U << 7 )
#define MPC_PWPR_PFSW_CLEAR    0U

#define MPC_P00PFS_ADDR        ( ( volatile uint8_t  * )0x0008C140 )
#define MPC_P01PFS_ADDR        ( ( volatile uint8_t  * )0x0008C141 )
#define MPC_P02PFS_ADDR        ( ( volatile uint8_t  * )0x0008C142 )
#define MPC_P03PFS_ADDR        ( ( volatile uint8_t  * )0x0008C143 )
#define MPC_P05PFS_ADDR        ( ( volatile uint8_t  * )0x0008C145 )
#define MPC_P07PFS_ADDR        ( ( volatile uint8_t  * )0x0008C147 )
#define MPC_P10PFS_ADDR        ( ( volatile uint8_t  * )0x0008C148 )
#define MPC_P11PFS_ADDR        ( ( volatile uint8_t  * )0x0008C149 )
#define MPC_P12PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14A )
#define MPC_P13PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14B )
#define MPC_P14PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14C )
#define MPC_P15PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14D )
#define MPC_P16PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14E )
#define MPC_P17PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14F )
#define MPC_P20PFS_ADDR        ( ( volatile uint8_t  * )0x0008C150 )
#define MPC_P21PFS_ADDR        ( ( volatile uint8_t  * )0x0008C151 )
#define MPC_P22PFS_ADDR        ( ( volatile uint8_t  * )0x0008C152 )
#define MPC_P23PFS_ADDR        ( ( volatile uint8_t  * )0x0008C153 )
#define MPC_P24PFS_ADDR        ( ( volatile uint8_t  * )0x0008C154 )
#define MPC_P25PFS_ADDR        ( ( volatile uint8_t  * )0x0008C155 )
#define MPC_P26PFS_ADDR        ( ( volatile uint8_t  * )0x0008C156 )
#define MPC_P27PFS_ADDR        ( ( volatile uint8_t  * )0x0008C157 )
#define MPC_P30PFS_ADDR        ( ( volatile uint8_t  * )0x0008C158 )
#define MPC_P31PFS_ADDR        ( ( volatile uint8_t  * )0x0008C159 )
#define MPC_P32PFS_ADDR        ( ( volatile uint8_t  * )0x0008C15A )
#define MPC_P33PFS_ADDR        ( ( volatile uint8_t  * )0x0008C15B )
#define MPC_P34PFS_ADDR        ( ( volatile uint8_t  * )0x0008C15C )
#define MPC_P40PFS_ADDR        ( ( volatile uint8_t  * )0x0008C160 )
#define MPC_P41PFS_ADDR        ( ( volatile uint8_t  * )0x0008C161 )
#define MPC_P42PFS_ADDR        ( ( volatile uint8_t  * )0x0008C162 )
#define MPC_P43PFS_ADDR        ( ( volatile uint8_t  * )0x0008C163 )
#define MPC_P44PFS_ADDR        ( ( volatile uint8_t  * )0x0008C164 )
#define MPC_P45PFS_ADDR        ( ( volatile uint8_t  * )0x0008C165 )
#define MPC_P46PFS_ADDR        ( ( volatile uint8_t  * )0x0008C166 )
#define MPC_P47PFS_ADDR        ( ( volatile uint8_t  * )0x0008C167 )
#define MPC_P50PFS_ADDR        ( ( volatile uint8_t  * )0x0008C168 )
#define MPC_P51PFS_ADDR        ( ( volatile uint8_t  * )0x0008C169 )
#define MPC_P52PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16A )
#define MPC_P54PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16C )
#define MPC_P55PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16D )
#define MPC_P56PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16E )
#define MPC_P57PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16F )
#define MPC_P60PFS_ADDR        ( ( volatile uint8_t  * )0x0008C170 )
#define MPC_P61PFS_ADDR        ( ( volatile uint8_t  * )0x0008C171 )
#define MPC_P66PFS_ADDR        ( ( volatile uint8_t  * )0x0008C176 )
#define MPC_P67PFS_ADDR        ( ( volatile uint8_t  * )0x0008C177 )
#define MPC_P70PFS_ADDR        ( ( volatile uint8_t  * )0x0008C178 )
#define MPC_P71PFS_ADDR        ( ( volatile uint8_t  * )0x0008C179 )
#define MPC_P72PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17A )
#define MPC_P73PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17B )
#define MPC_P74PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17C )
#define MPC_P75PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17D )
#define MPC_P76PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17E )
#define MPC_P77PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17F )
#define MPC_P80PFS_ADDR        ( ( volatile uint8_t  * )0x0008C180 )
#define MPC_P81PFS_ADDR        ( ( volatile uint8_t  * )0x0008C181 )
#define MPC_P82PFS_ADDR        ( ( volatile uint8_t  * )0x0008C182 )
#define MPC_P83PFS_ADDR        ( ( volatile uint8_t  * )0x0008C183 )
#define MPC_P86PFS_ADDR        ( ( volatile uint8_t  * )0x0008C186 )
#define MPC_P87PFS_ADDR        ( ( volatile uint8_t  * )0x0008C187 )
#define MPC_P90PFS_ADDR        ( ( volatile uint8_t  * )0x0008C188 )
#define MPC_P91PFS_ADDR        ( ( volatile uint8_t  * )0x0008C189 )
#define MPC_P92PFS_ADDR        ( ( volatile uint8_t  * )0x0008C18A )
#define MPC_P93PFS_ADDR        ( ( volatile uint8_t  * )0x0008C18B )
#define MPC_PA0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C190 )
#define MPC_PA1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C191 )
#define MPC_PA2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C192 )
#define MPC_PA3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C193 )
#define MPC_PA4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C194 )
#define MPC_PA5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C195 )
#define MPC_PA6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C196 )
#define MPC_PA7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C197 )
#define MPC_PB0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C198 )
#define MPC_PB1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C199 )
#define MPC_PB2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19A )
#define MPC_PB3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19B )
#define MPC_PB4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19C )
#define MPC_PB5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19D )
#define MPC_PB6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19E )
#define MPC_PB7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19F )
#define MPC_PC0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A0 )
#define MPC_PC1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A1 )
#define MPC_PC2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A2 )
#define MPC_PC3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A3 )
#define MPC_PC4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A4 )
#define MPC_PC5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A5 )
#define MPC_PC6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A6 )
#define MPC_PC7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A7 )
#define MPC_PD0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A8 )
#define MPC_PD1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A9 )
#define MPC_PD2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AA )
#define MPC_PD3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AB )
#define MPC_PD4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AC )
#define MPC_PD5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AD )
#define MPC_PD6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AE )
#define MPC_PD7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1BF )
#define MPC_PE0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B0 )
#define MPC_PE1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B1 )
#define MPC_PE2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B2 )
#define MPC_PE3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B3 )
#define MPC_PE4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B4 )
#define MPC_PE5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B5 )
#define MPC_PE6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B6 )
#define MPC_PE7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B7 )
#define MPC_PF0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B8 )
#define MPC_PF1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B9 )
#define MPC_PF2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1BA )
#define MPC_PF5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1BD )
#define MPC_PFS_PSEL0          0x0
#define MPC_PFS_PSEL1          0x1
#define MPC_PFS_PSEL2          0x2
#define MPC_PFS_PSEL3          0x3
#define MPC_PFS_PSEL4          0x4
#define MPC_PFS_PSEL5          0x5
#define MPC_PFS_PSEL6          0x6
#define MPC_PFS_PSEL7          0x7
#define MPC_PFS_PSEL8          0x8
#define MPC_PFS_PSEL9          0x9
#define MPC_PFS_PSELA          0xA
#define MPC_PFS_PSELB          0xB
#define MPC_PFS_PSELC          0xC
#define MPC_PFS_PSELD          0xD
#define MPC_PFS_PSELE          0xE
#define MPC_PFS_PSELF          0xF
#define MPC_PFS_ISEL           ( 1U << 6 )
#define MPC_PFS_ASEL           ( 1U << 7 )

